Revit 2027 API
ParameterFilterUtilities.GetAllFilterableCategories Method
 Returns the set of categories that may be used in a ParameterFilterElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetAllFilterableCategories()
Public Shared Function GetAllFilterableCategories As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetAllFilterableCategories()
static member GetAllFilterableCategories : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The set of all filterable categories.
See Also
Reference
ParameterFilterUtilities Class
Autodesk.Revit.DB Namespace